{"0": ["Afghan Hound", "\n\n​Since ancient times, Afghan Hounds have been famous for their elegant beauty. But the thick, flowing coat that is the breed’s crowning glory isn’t just for show—it served as protection from the harsh climate in mountainous regions where Afghans originally earned their keep. Beneath the glamorous exterior is a powerful, agile hound—standing as high as 27 inches at the shoulder—built for a long day’s hunt. Their huge paw pads act as shock absorbers on their homeland’s punishing terrain.\n\n"], "1": ["Airedale Terrier", "\n\nThe sturdy Airedale is the largest of all terriers. Males stand about 23 inches at the shoulder; females are a bit smaller. The wire coat is tan with dark markings. Rangy but muscular legs give Airedales a regal lift in their bearing, and the long head—with its sporty beard and mustache, expressive eyes, and neatly folded ears—conveys a keen intelligence. Airedales are the picture of an alert and willing terrier—and then some.\n\n"], "2": ["Alaskan Malamute", "\n\nThe largest and oldest of the Arctic sled dogs, the Alaskan Malamute possesses great strength and endurance. He is not designed to race, but rather to carry large loads over long distances. Today, many Malamutes are family pets, but are highly athletic and still capable of enjoying sledding, weight-pulling, back-packing, jogging and swimming with their owners. The Malamute coat is thick and coarse, with a plumed tail carried over the back. The coat usually ranges in color from light gray to black or from sable to red. Face markings, including a cap on the head and a bar/mask on the face are often distinguishing features.\n\n"], "3": ["American Staffordshire Terrier", "\n\nCourageous and strong, the American Staffordshire Terrier (Am Staff)'s athletic build and intelligence make him ideally suited to many dog sports such as obedience, agility, tracking and conformation. He is often identified by his stocky body and strong, powerful head. The breed's short coat can be any color, and either solid colored, parti-colored or patched.\n\n"], "4": ["Australian Terrier", "\n\nThe Australian Terrier is small and sturdy with a blue and tan, sandy or red coat that is harsh in texture. They have a keen and alert expression and confident spirit. They are versatile in their work and living situations, making suitable companions in most environments.\n\n"], "5": ["Barbet", "\n\n\n"], "6": ["Basenji", "\n\nBasenjis are small, graceful hounds instantly recognizable by their glistening short coat, tightly curled tail, and wrinkled forehead and expressive almond-shaped eyes that convey a variety of subtle, human-like emotions. Basenjis are a lovely sight at a standstill but more impressive yet at a fast trot, when they exhibit the long, smooth strides of a mini racehorse. And yes, it’s true, they don’t bark. But these clever hounds make their feelings known with an odd sound described as something between a chortle and a yodel.\n\n"], "7": ["Basset Hound", "\n\n​The Basset Hound has such a distinct look—a short, low-to-the-ground body with big, hanging ears—it’s no wonder it has inspired several cartoon characters (including one named, you guessed it, Droopy). But its incredible hunting instinct and scenting abilities are what first earned this breed its popularity. As pets, Bassets are extremely patient (especially with young kids who tend to yank at their ears when not supervised) and easy to train, and despite their plodding pace, they do well at various dog sports.\n\n"], "8": ["Beagle", "\n\nNot only are Beagles excellent hunting dogs and loyal companions, they are also happy-go-lucky, funny, and—thanks to their pleading expression—cute. They were bred to hunt in packs, so they enjoy the company of other dogs and of people as well. Beagles love to follow their noses, which can sometimes get them into sticky situations. These dogs are solid, sturdy, and fairly easy to care for, but they do need to run around and let off steam.\n\n"], "9": ["Belgian Sheepdog", "\n\nElegant and proud, the Belgian Sheepdog is strong, but not bulky. During WWI, Belgian Sheepdogs distinguished themselves on the battlefields, serving as message carriers, ambulance dogs, and even pulling machine guns. It is no wonder that today this breed performs well in sports like obedience, herding, and tracking. They are also excellent workers, and work as search and rescue dogs, guide dogs, and therapy dogs. This breed is completely black, or may be black with white, although there are limitations to their white markings.\n\n"], "10": ["Bernese Mountain Dog", "\n\n​A hardy dog that thrives in cold weather, the Bernese Mountain Dog's intelligence and strength originally helped him perform work on the Swiss farms. Today, this versatile breed enjoys playing sports and spending time with his human companions. Although Bernese Mountain Dogs will get along with the entire family, they'll often become more attached to one lucky human.\n\n"], "11": ["Bloodhound", "\n\nBloodhounds are large, substantial dogs standing 23 to 27 inches at the shoulder and weighing up to 110 pounds. Their most famous features are a long, wrinkled face with loose-hanging skin; huge drooping ears; and warm, deep-set eyes that complete an expression of solemn dignity. The coat color can be black and tan, liver (reddish brown) and tan, or red. A thick, powerful body and legs allow Bloodhounds to follow a trail over miles of tough, punishing terrain.\n\n"], "12": ["Border Collie", "\n\nBorder Collies are athletic, medium-sized herders standing 18 to 22 inches at the shoulder. The overall look is that of a muscular but nimble worker unspoiled by passing fads. Both the medium-length rough coat and the shorter smooth coat come in a wide variety of colors and patterns. The oval eyes are the focus of an intelligent expression—an intense gaze, the Border Collie's famous “herding eye,” is a breed hallmark. In motion, they are among the canine kingdom’s most agile, balanced, and tireless citizens.\n\n"], "13": ["Border Terrier", "\n\nBorder Terriers stand from 11 to 16 inches at the shoulder and weigh from 11.5 to 15.5 pounds. The short, wiry coat can be grizzle and tan, blue and tan, wheaten, or red. They’re easy to recognize among other terriers by their unique head shape: “otter head,” as Border Terrier fans say. Another distinguishing trait is that they’re longer in leg than other terriers of their weight. The breed’s admirers cherish the Border Terrier's reputation as a tough, no-nonsense working terrier.\n\n"], "14": ["Borzoi", "\n\n​Borzoi are large, elegant sighthounds whose construction follows the ancient Greyhound template. A mature male will stand at least 28 inches at the shoulder and weigh 75 to 105 pounds. Females will be smaller. Once known as Russian Wolfhounds, Borzoi were bred to be swift and strong enough to pursue and pin their ferocious lupine quarry. A Borzoi in full stride is a majestic sight: a princely package of strength, grace, and glamor cruising at 35 to 40 miles per hour.\n\n"], "15": ["Boston Terrier", "\n\n​Boston Terriers are compact, short-tailed, well-balanced little dogs weighing no more than 25 pounds. The breed is famous for its “tuxedo” coat: white and either black, brindle (a dark striped pattern), or seal (appears black except it has a red cast when viewed in sun or bright light). The muzzle is short and the eyes are large, dark, and round, giving Boston Terriers a kind and intelligent expression that can melt the coldest heart.\n\n"], "16": ["Bouvier des Flandres", "\n\nLarge sized rugged and compact, Bouvier des Flandres are from a time and place where a dog had to work like … well, a dog. Standing as high as 27.5 inches, with heavy bone and powerful muscles beneath a weatherproof coat, Bouviers were bred to do anything that needs doing in a barnyard or pasture except milk the cows. Yet, Bouvier des Flandres are more than just farm equipment. Their sterling character, huge heart, and keen intelligence have endeared them to dog lovers all over the world over.\n\n"], "17": ["Boxer", "\n\n​A well-conditioned Boxer is an awesome sight. A male can stand as high as 25 inches at the shoulder, females a little shorter. Their muscles ripple beneath their short, tight-fitting coat. The dark brown eyes and wrinkled forehead give the face an alert, curious look. Boxers move like the athletes they’re named for: smooth and graceful, but powerful. The coat can be fawn (tan to mahogany-red) or brindle (kind of like tiger stripes), with white markings.\n\n"], "18": ["Briard", "\n\nThese handsome, muscular Frenchmen are known for a wavy coat of either gray, tawny, or black, and an impressive head topped by a peek-a-boo hairdo parted naturally in the middle. A luxurious beard and eyebrows accentuate an expression Briard fans describe as “frank and questioning.” Standing between 22 and 27 inches at the shoulder (females at the small end of the scale), Briards are burly and rugged but move with a nimble-footed gait. Their dashing looks radiate a distinct aura of Gallic romance and elegance.\n\n"], "19": ["Brittany", "\n\n​Brittanys are unique sporting dogs: Smaller than setters but leggier than spaniels, they stand about 20 inches at the shoulder. Known for their beautiful, boldly patterned coat, Brittanys come in combinations of white and vivid orange and liver (reddish-brown). They’re rugged and strong—the word “muscular” occurs more than once in the breed standard—but smooth, clean, and quick afoot. The face has the “softness” prized by bird-dog lovers; high-set ears convey the breed’s essential eagerness.\n\n"], "20": ["Brussels Griffon", "\n\nThe intelligent and cheerful Brussels Griffon has a terrier-like disposition and is known for his almost human expression. This affectionate breed comes in a variety of colors, including red, belge (black and reddish brown), black and tan, or black. This breed makes a good watchdog and can be taught to perform a variety of tricks. A Brussels Griffon was featured in 1997's hit, \"As Good As It Gets\", starring Jack Nicholson and Helen Hunt.\n\n"], "21": ["Bull Terrier", "\n\nPlayful and clownish, the Bull Terrier is best described as a three-year-old child in a dog suit. Given his muscular build, the Bull Terrier can appear unapproachable, but he is an exceedingly friendly dog, with a sweet and fun-loving disposition and popular in the obedience, agility and show rings. The Bull Terrier can be all white (markings on the head are permissible) or colored.\n\n"], "22": ["Bulldog", "\n\nKnown for their loose-jointed, shuffling gait and massive, short-faced head, the Bulldog is known to be equable, resolute and dignified. A medium-sized dog, they are not your typical lap dog, but would like to be! They are one of the most popular breeds according to AKC® Registration Statistics due to their lovable and gentle dispositions and adorable wrinkles. The Bulldog may be brindle, white, red, fawn, fallow or piebald.\n\n"], "23": ["Cairn Terrier", "\n\nBest known as \"Toto\" from the Wizard of Oz, the Cairn Terrier is a small, hardy working terrier. Originally bred to aid Scottish farmers in ridding their properties of pests, Cairns today use their tenacity to excel in obedience, agility, terrier and tracking trials. Alert and active, this breed possesses a harsh, weather-resistant outer coat that can be any color except white. The hair around the head gives him a general foxy expression.\n\n"], "24": ["Cardigan Welsh Corgi", "\n\nLong, low-set dogs with sturdy bone, short legs, and a deep chest, Cardigan Welsh Corgis are powerful little workers of deceptive speed and grace. They can weigh anywhere from 25 to 34 pounds, with females at the lower end of the range. They come in several coat colors, from red to the popular blue-merle pattern. The quickest way to distinguish Cardigans from their cousins, Pembroke Welsh Corgis, is to check out the hindquarters: Cardigans have tails; Pembrokes do not.\n\n"], "25": ["Chesapeake Bay Retriever", "\n\nChesapeake Bay Retrievers are strong, powerfully built gundogs standing anywhere from 21 to 26 inches at the shoulder, with females occupying the lower end of the range. A good-size male can weigh up to 80 pounds. The distinctive breed trait is a wavy waterproof coat that’s oily to the touch. Chessies are solid-colored, either \"chocolate-y\" brown, sedge (red-gold), or deadgrass (straw). The keen yellow-amber eyes draw attention to an eager, intelligent expression.\n\n"], "26": ["Chihuahua", "\n\nChihuahuas are tiny dogs that come in many different colors and markings, and can have either long or short coats, but they all have large, alert ears, big moist eyes, and huge personalities. Inside each little Chihuahua is a miniature king or queen ready to rule their realms, so they need to be taught what is acceptable in human kingdoms. They are intelligent and enthusiastic, so they usually don’t need extensive training.\n\n"], "27": ["Chinook", "\n\nAt a glance you know Chinooks weren’t built for lying on the sofa watching General Hospital with Grandma. These tawny-coated, no-frills workers are muscular and substantial, with males standing as high as 26 inches at the shoulder. Females, with their distinctly feminine look, are a bit smaller. Chinooks were conceived as dual-purpose haulers, with the power of freighting dogs and the speed of sled racers. They’re the picture of stouthearted dignity, with a kindly twinkle in their dark almond eyes.\n\n"], "28": ["Chow Chow", "\n\nChows are powerful, compactly built dogs standing between 17 and 20 inches at the shoulder. Their several distinctive features include a lion’s-mane ruff around the head and shoulders; a blue-black tongue; deep-set almond eyes that add to a scowling, snobbish expression; and a “stilted” (stiff-legged) way of moving. Chows can have rough or smooth coats of red, black, blue, cinnamon, or cream. Overall, Chows present the picture of a muscular, deep-chested aristocrat with an air of inscrutable timelessness.\n\n"], "29": ["Clumber Spaniel", "\n\nClumber Spaniels are large dogs, but not by height—at 17 to 20 inches Clumbers stand as high as many “medium” dogs. Rather, Clumbers are large by weight: A small female might be 55 pounds, and a big male could go 85 pounds. Clumbers are powerful bird dogs of heavy bone, built long and low, with a massive head. They’re primarily white, with sparse lemon or orange markings. Built to plow through thick cover in the field, Clumber movement is nonetheless free and easy.\n\n"], "30": ["Cocker Spaniel", "\n\nExhibited in the US since the 1880s, the Cocker Spaniel remains one of the most popular breeds according to AKC® registration statistics. The Cocker has a sturdy, compact body and a silky, flat or wavy coat. He is a merry, well-balanced dog that is capable of considerable speed and great endurance. Cocker Spaniels can be black, black with tan points, parti-colored or any solid color other than black (ASCOB).\n\n"], "31": ["Collie", "\n\nThese elegant dogs are legendary for their herding and protecting abilities. They are strong, loyal, affectionate, responsive and fast. The rough-coated Collie has a beautiful long coat. It can look as if it’s floating across the landscape when it runs. The coats of both varieties—rough and smooth—used to be mostly black, but now can be sable and white, tri-color, blue merle and white. The breed has an elegant wedge-shaped head. Collies can do well in the country or the city, but need companionship.\n\n"], "32": ["Dachshund", "\n\nThe Dachshund, meaning \"badger dog\" in German, is a lively breed with a friendly personality and keen sense of smell. Known for their long and low bodies, they are eager hunters that excel in both above- and below-ground work. One of the most popular breeds according to AKC® Registration Statistics, they come in three different coat varieties (Smooth, Wirehaired or Longhaired) and can be miniature or standard size.\n\n"], "33": ["Dalmatian", "\n\nThe only spotted breed, the Dalmatian is alert and active, possessing great endurance, speed and intelligence. Their working and sporting heritage makes them suitable as both a family pet or performance animal, and they are often found in the show, obedience and agility rings, or galloping alongside a horse as a coach dog in \"road trials.\" Their short coat is white with black or liver (brown) spots.\n\n"], "34": ["Doberman Pinscher", "\n\nA square, medium-sized dog, the Doberman Pinscher is muscular and possesses great endurance and speed. He is elegant in appearance and reflects great nobility and temperament. The properly bred and trained Doberman has proved itself to be a friend and guardian, and his intelligence and ability to absorb and retain training have brought him into demand as a police and war dog. The Doberman's short, hard coat can be black, red, blue and fawn.\n\n"], "35": ["English Cocker Spaniel", "\n\nAn active sporting dog, the English Cocker Spaniel'\u0019s compact, solid body practically vibrates with energy and enthusiasm, particularly when at work in the field. Although known for its soft, melting spaniel expression, the breed is a tough worker, capable of covering ground effortlessly and penetrating the densest of cover. His coat can be solid-colored (black, liver or shades of red) or parti-colored, including ticking or roaning.\n\n"], "36": ["English Setter", "\n\nEnglish Setters are elegant but substantial gundogs known for their beauty and agreeable temperament. The word “belton,” unique to this breed, describes the speckled patterns of the coat, which comes in colors that sound good enough to eat: liver, lemon, and orange among them. Beneath the showy coat is a well-balanced hunter standing about 25 inches at the shoulder. The graceful neck carries a long, oval-shaped head proudly, and the dark brown eyes convey a soft expression that reflects the breed’s sweet soul.\n\n"], "37": ["English Springer Spaniel", "\n\nThe Springer is the place where beauty and utility meet. Standing 19 to 20 inches at the shoulder, and weighing between 40 and 50 pounds, Springers are tough, well-muscled hunters. Their energy, stamina, brains, and smooth “rear drive” movement have earned them an exalted place in the realm of bird dogs. But a Springer— with his smartly marked coat, yearning spaniel expression, and long, lush ears—would be prized for good looks even if he couldn’t tell a grouse from a mouse.\n\n"], "38": ["French Bulldog", "\n\nThis affectionate and playful breed—known for its wrinkly, smushy face and bat-like ears—is a great companion for single pet-owners as well as families with young children. They need little exercise and grooming and are incredibly loyal to their people. Because of their somewhat stubborn nature, they require a bit of patience during training but are incredibly intelligent and eager to please.\n\n"], "39": ["German Shepherd Dog", "\n\nGenerally considered dogdom's finest all-purpose workers, German Shepherd Dogs are large, agile, muscular dogs of noble spirit and high intelligence. For such deep-chested, solid dogs, they move quickly with great nimbleness afoot. The German Shepherd's natural gait is a free-and-easy trot, but when duty calls they can turn it up a notch or two and reach great speeds. Standing as high as 26 inches at the shoulder and built like a brick doghouse, the German Shepherd Dog when viewed in outline presents a picture of smooth, graceful curves rather than angles.\n\n"], "40": ["Giant Schnauzer", "\n\nA well-bred Giant Schnauzer closely resembles the Standard Schnauzer—only bigger. As their name suggests, Giants are imposing. A male might stand as high as 27.5 inches at the shoulder and weigh 95 pounds. The muscular, substantial body is, as the breed’s fanciers put it, a “bold and valiant figure of a dog.” The double coat is either solid black or “pepper and salt.” Familiar characteristics of the Mini, Standard, and Giant are a harsh beard and eyebrows, accentuating a keen, sagacious expression.\n\n"], "41": ["Golden Retriever", "\n\nIt’s not surprising that Golden Retrievers are one of the most popular dog breeds in the United States. Along with being exuberant and friendly, they are strong dogs and hard workers. Goldens are good at whatever they do, be it hunting, serving as guide dogs, working search-and-rescue, or being devoted companions. Though they are serious about their work, they also enjoy being downright silly!\n\n"], "42": ["Gordon Setter", "\n\nGordon Setters are the largest and most substantial of setters—a big male might stand 27 inches at the shoulder and weigh 80 pounds. The stunning coat is a glistening black, with tan markings and long hair on the ears, belly, legs, chest, and tail. Tan spots above the bright brown eyes point up a wise and willing expression. Like other Scots breeds, from the compact Scottish Terrier to the majestic Scottish Deerhound, Gordon Setters were built to withstand their homeland’s tough terrain and foul weather.\n\n"], "43": ["Great Dane", "\n\nEven people with zero dog knowledge know a Great Dane when they see one. Standing as high as 32 inches at the shoulder, Danes tower over most other dogs—and when standing on their hind legs, they’re taller than many people. Giant-sized and immensely strong, Danes nevertheless are the picture of elegance and balance, with the smooth and easy stride of born noblemen. The coat comes in different colors and patterns, perhaps the best-known being the black-and-white patchwork pattern known as “harlequin.”\n\n"], "44": ["Great Pyrenees", "\n\nFrequently described as “majestic,” Great Pyrenees are big, immensely strong mountain dogs standing as high as 32 inches at the shoulder and often tipping the scales at more than 100 pounds. These steadfast guardians usually exhibit a Zen-like calm, but they can quickly spring into action and move with grace and speed to meet a threat. The lush weatherproof coat is all white, or white with markings of beautiful shades of gray, tan, reddish-brown, or badger.\n\n"], "45": ["Greater Swiss Mountain Dog", "\n\n“Greater” than what? Well, standing as high as 28.5 inches and weighing as much as a midsize human, a Greater Swiss Mountain Dog might easily be greater than you. Swissies are immensely strong, yet agile enough to move a flock across the sloping foot of a mountain. The coat is a striking tricolor—black, red, and white. The head and muzzle typically have a white marking (the “blaze”), setting off a sweet expression. Several big mountain-dog breeds are described as “majestic,” but Swissies practically invented the word.\n\n"], "46": ["Greyhound", "\n\nGreyhounds are the essence of the dog breeder’s credo “Form follows function.” From the narrow, aerodynamic skull to the shock-absorbing pads of the feet, Greyhounds are perfectly constructed for high-speed pursuit. The lean beauty of the Greyhound “inverted S” shape, created by the deep chest curving gently into a tightly tucked waist, has been an object of fascination for artists, poets, and kings for as long as human beings have called themselves civilized. Greyhounds are the template from which other coursing hounds have been struck.\n\n"], "47": ["Ibizan Hound", "\n\nIbizan Hounds are lithe and leggy visitors from the dawn of civilization. Art history students will recognize the elongated head, with its large erect ears, as a familiar motif of ancient Egypt. The elegant, racy body stands 22.5 to 27.5 inches at the shoulder, with coat colors of solid red or white, or red and white patterns. The rosy-colored leathers of the nose, eye rims, and lips—along with amber or caramel eyes—perfectly complement the coat. The breed’s quiet grace is often described as deer-like.\n\n"], "48": ["Irish Setter", "\n\nFirst, there’s that gorgeous red coat. You won’t have to worry about losing track of your pet at the dog park—the flashy Irish Setter stands out in any crowd. Underneath the coat is a true athlete, over two feet tall at the shoulder and weighing 60 to 70 pounds. The breed was created as a hunter’s companion who can do a hard day’s work in the field. Irish Setters are famous for their grace and speed.\n\n"], "49": ["Irish Terrier", "\n\nIrish Terriers are the prototype of a long-legged terrier. Standing about 18 inches at the shoulder, they’re sturdy but lithe and graceful. Every line of the body is eye-catching, and the overall picture is beautifully balanced. The tight red coat is as fiery as the breed’s temperament. ITs are a dog lover’s delight: If your heart doesn’t go pitty-pat at the sight of this Technicolor terrier framed against the vivid greens of the Irish countryside, forget dogs and buy a goldfish.\n\n"], "50": ["Irish Wolfhound", "\n\nBig? That’s putting it mildly. The Irish Wolfhound is an immense, muscular hound. A fully mature male might stand 32 to 34 inches at the shoulder and weigh 120 pounds. This tallest of all AKC breeds is nonetheless gracefully built along classic Greyhound lines and can cover lots of ground quickly when at full gallop. The hard, medium-length coat comes in many colors, including white, gray, brindle, red, black, and fawn.\n\n"], "51": ["Italian Greyhound", "\n\nThe Italian Greyhound is extremely slender and barely over a foot tall, but has all the grace and sweetness of his taller Greyhound relatives. There is debate as to whether they were originally bred for hunting small game or meant to be simply a companion. In all likelihood, both are true, as they are adaptable to city and country life. The Italian Greyhound's coat can be any color, except brindle and classic black and tan.\n\n"], "52": ["Keeshond", "\n\nA medium-sized, sturdy dog, the Keeshond possesses the characteristics of other Northern breeds - a fox-like expression, stand-off coat and richly plumed tail carried over the back. His coloring is a mixture of gray, black and cream, with variations from light to dark and distinctive \"spectacles\" - markings and shadings in the eye area, including a delicate, dark line slanting from eye to ear and expressive eyebrows.\n\n"], "53": ["Kuvasz", "\n\nBold, courageous and fearless, the Kuvasz is an unparalleled livestock guard, able to act at just the right moment without instruction and cover rough terrain for long periods of time. One of the larger working breeds, he is well-muscled and agile. His double coat features a coarse guard hair that protects a soft, fine undercoat. The hair ranges from straight to quite wavy, but must always be white.\n\n"], "54": ["Labrador Retriever", "\n\nThe gentle, intelligent and family-friendly Labrador Retriever from Canada continues to be the most popular breed in the United States, according to AKC registration statistics. This versatile hunting breed comes in three colors - yellow, black and chocolate - and because of their desire to please their master they excel as guide dogs for the blind, as part of search-and-rescue teams or in narcotics detection with law enforcement.\n\n"], "55": ["Lakeland Terrier", "\n\nThe Lakeland Terrier has a dense, wiry coat with longer hair on the legs and muzzle, often giving him a distinct beard. Small, sturdy and workmanlike, the breed's narrow frame allows him to squeeze into rocky dens to chase after vermin. While generally a show dog or family companion today, Lakelands can also be found utilizing their natural instincts at earthdog events or digging in the backyard. The breed comes in a variety of colors including blue, black, liver, red and wheaten with or without a patch of color over the back and shoulders called a \"saddle\".\n\n"], "56": ["Lhasa Apso", "\n\nThe Lhasa Apso is a small, hardy breed with a beautiful cloak of hair that parts down the back from head to tail. Their temperament is unique: joyful and mischievous, dignified and aloof. An independent breed, the Lhasa's goal in life is not necessarily to please their master. Popular in the show ring, the breed also excels at activities that provide constant challenges, such as agility.\n\n"], "57": ["Maltese", "\n\n​Maltese are toy dogs weighing less than seven pounds, covered by a long, silky coat. Beneath that all-white mantle is a compact body moving with a smooth, effortless gait. The overall picture depicts free-flowing elegance and balance. The Maltese face—with its big, dark eyes and black gumdrop nose—has been enchanting owners since the Bible was a work in progress. Don’t let the showy looks fool you: These are hearty, adaptable pets. It takes a whole lot of dog to survive three millennia.\n\n"], "58": ["Mastiff", "\n\nFor the uninitiated, a face-to-face encounter with these black-masked giants can be startling. Standing as high as 30 inches at the shoulder and outweighing many a full-grown man, Mastiffs make an immediate and lasting impression. The rectangular body is deep and thickly muscled, covered by a short double coat of fawn, apricot, or brindle-stripe. The head is massive (a word that comes up often with this breed), and a wrinkled forehead accentuates an alert, kindly expression.\n\n"], "59": ["Miniature Pinscher", "\n\nMiniature Pinschers are sturdy, compact dogs standing no more than 12.5 inches at the shoulder. The smooth, shiny coat comes in two shades of solid red, or chocolate-and-rust or black-and-rust. The dark, slightly oval eyes and high-set ears help bring out a self-possessed, “big dog” personality. A distinguishing characteristic is the Min Pin’s high-stepping “hackney” gait, reminiscent of a hackney horse at the trot.\n\n"], "60": ["Miniature Schnauzer", "\n\nStocky, robust little dogs standing 12 to 14 inches at the shoulder, Miniature Schnauzers were bred down from their larger cousins, Standard Schnauzers. Aside from the size difference, the two breeds look much alike. The bushy beard and eyebrows give Minis a charming, human-like expression. The coat comes in three color patterns: salt and pepper, black and silver, and solid black. Created to be all-around farm dogs and ratters, they’re rugged and muscular—fearless, but not aggressive.\n\n"], "61": ["Newfoundland", "\n\nA large dog and a true workhorse, the Newfoundland is a master at long-distance swimming and has true lifesaving instincts in the water. He is large and strong, possessing a heavy coat to protect him from icy waters. Equally at home in the water and on land, today's Newfoundland competes in conformation, obedience, agility, tracking, draft and water tests, and carting. His coat can be black, brown, gray, or white and black.\n\n"], "62": ["Norfolk Terrier", "\n\nOne of the smallest working terriers, the Norfolk Terrier is active, compact and hardy, considered to be the \"perfect demon\" in the field. Farmers and hunters admire the breed's gameness, loyalty and great charm. Known for his drop ears, the Norfolk Terrier has a wiry, weather resistant coat that can be red, wheaten, black and tan or grizzle.\n\n"], "63": ["Norwegian Elkhound", "\n\nA solid, sturdy hunter of elk, bear and other wild animals, the Norwegian Elkhound has a temperament that is dignified, independent and generally, friendly. A hardy silver-grey dog with distinctive saddle markings and medium in size and substance, the Norwegian Elkhound is not only know for its hunting ability but also for its versatility and stamina, which in rugged terrains remains unparalleled.\n\n"], "64": ["Norwich Terrier", "\n\nSpirited and stocky with prick ears and a slightly foxy expression, the Norwich Terrier is one of the smallest working terriers. Despite his small size, the Norwich has good substance and is an eager worker. The breed's wiry, weather resistant coat can be red, wheaten, black and tan or grizzle.\n\n"], "65": ["Old English Sheepdog", "\n\nIts trademark is its beautiful, profuse coat, but the intelligent and agile Old English Sheepdog (OES) can easily complete any demanding task asked of him by a shepherd or drover. Square in build and possessing great strength, the OES enjoys working and is seen in the conformation, obedience, agility and herding rings today with their characteristic shuffling gait. His coat, which serves as insulation, can be any shade of gray, grizzle, blue or blue merle with or without white markings.\n\n"], "66": ["Papillon", "\n\nThe Papillon is a small, friendly, elegant toy dog with a fine boned structure. He is light and dainty, yet still lively, and is distinguished from other breeds by his beautiful, butterfly-like ears. They are known to be happy and alert little dogs that are not shy or aggressive. The breed must be either parti-color or white with patches of any color.\n\n"], "67": ["Pekingese", "\n\nChinese art throughout the ages, starting with the Tang dynasty of the 8th century, abounds with images of the Pekingese, who gets his name from the ancient city of Peking, now called Beijing. Pekingese were held sacred in ancient China and could only be owned by royalty. At that time, the punishment for stealing a Pekingese was death. Pekingese came to Europe as a result of war. When the British overtook the Chinese Imperial Palace in 1860, they returned home with several of the dogs.\n\n"], "68": ["Pembroke Welsh Corgi", "\n\nLow-set, strong and sturdily built, the Pembroke Welsh Corgi gives an impression of substance in a small space. He is one of the most agreeable small house dogs, as well as an avid competitor in many dog sports, including conformation, herding and obedience. The Pembroke Corgi is a separate breed from the Cardigan Corgi, possessing a shorter body and straighter, lighter boned legs. His ears are pointed at the tip and stand erect, and he has a short tail. The coat can be red, sable, fawn, black and tan with or without white markings.\n\n"], "69": ["Pointer", "\n\nA hard-driving hunting dog possessing stamina, courage, and the desire to go, the Pointer is bred primarily for sport afield and definitely looks the part. He gives the impression of compact power and agile grace, with a noble carriage, an intelligent expression and a muscular body. His short coat can be liver, lemon, black or orange; either in combination with white or solid-colored.\n\n"], "70": ["Pomeranian", "\n\nThe Pomeranian is a cocky, animated companion with an extroverted personality. This compact little dog is an active toy breed with an alert character and fox-like expression. Today, the Pomeranian is a popular companion dog and competitive show dog. They can come in all colors, patterns, and variations although orange and red are the most popular.\n\n"], "71": ["Poodle", "\n\nThe Poodle, though often equated to the beauty with no brains, is exceptionally smart, active and excels in obedience training. The breed comes in three size varieties, which may contribute to why Poodle is one of the most popular breeds according to AKC® Registration statistics. Poodles can be a variety of solid colors, including white, black, apricot and gray, but never parti-colored.\n\n"], "72": ["Pug", "\n\nThe Pug is well described by the phrase \"multum in parvo\" which means \"a lot of dog in a small space.\" They are recognized for their even-tempers, playful personalities, and their outgoing, loving dispositions. This square and cobby breed comes in fawn or black, with a well-defined \"mask\" on his muzzle. A popular companion dog, the pug also excels in the show ring.\n\n"], "73": ["Rat Terrier", "\n\nThe Rat Terrier is a multipurpose companion dog that is capable of hunting rodents and vermin above and below ground as well as coursing small game. He is a sturdy, compact, small-to-medium sized parti-colored dog giving the appearance of elegance and athleticism. His short, smooth coat may come in any variation of pied patterning. Pied is described as comparatively large patches of one or more colors in combination with white. Acceptable colors, with or without \"tan points\", include the predominate black, or chocolate, red, apricot, blue, fawn, tan, or lemon.\n\n"], "74": ["Rhodesian Ridgeback", "\n\nA large and muscular dog, the Rhodesian Ridgeback was not only developed as hunter but also as a family protector. The breed can be light wheaten to red wheaten and are sleek and glossy in appearance. Originally bred to hunt lions the breed is also known as the African Lion Hound.\n\n"], "75": ["Rottweiler", "\n\nRobust and powerful, the Rottweiler is happiest when given a job to perform. His intelligence, endurance and willingness to work make him suitable as a police dog, herder, service dog, therapy dog, obedience competitor and devoted companion. An inherent protector, the Rottweiler is self-confident and responds quietly and with a wait-and-see attitude to influences in his environment. He must be medium in size and his coat is black with rust to mahogany markings.\nFind Rottweiler Puppies\n\n"], "76": ["Saluki", "\n\nAlthough the breed appears graceful and fragile, don't be fooled - the Saluki is an avid hunter and possesses the strength and endurance to chase quarry over long distances and difficult terrain. Today, this sight hound is popular at lure coursing events and in the show ring. Salukis can be coated (with feathering on the legs) or smooth. In both varieties, colors include white, cream, fawn, golden, red, grizzle and tan, tricolor, and black and tan.\n\n"], "77": ["Samoyed", "\n\nSamoyeds, the smiling sledge dogs, were bred for hard work in the world’s coldest locales. In the Siberian town of Oymyakon, for instance, temperatures of minus-60 degrees are common. The Sammy’s famous white coat is thick enough to protect against such brutal conditions. Powerful, agile, tireless, impervious to cold—Sammies are drop-dead gorgeous but highly functional. Even their most delightful feature, a perpetual smile, has a practical function: The mouth’s upturned corners keep Sammies from drooling, preventing icicles from forming on the face.\n\n"], "78": ["Schipperke", "\n\n​Standing no higher than 13 inches, Schipperkes are small dogs built for hard work. Schips were created as ratters and watchdogs. Their powerful jaws, necks, and forequarters—coupled with a stealthy, catlike hunting style—make them ideal rat-catching machines. The black coat is profuse around the neck, shoulders, and legs, giving the breed a silhouette that accentuates a thick, substantial body. The foxy face completes the unique look of a unique breed. If you can’t tell a Schipperke from an ordinary dog, you simply haven’t been paying attention.\n\n"], "79": ["Scottish Deerhound", "\n\nStand back: You need a little distance to fully appreciate the majesty of this ancient beast. In silhouette we see a noble coursing hound struck from the classic Greyhound template. Deerhounds are, though, much larger and more substantial than Greyhounds—a good-size male can stand 32 inches at the shoulder and weigh 110 pounds. The crisp coat is seen in several colors; breed aficionados prefer the dark blue-gray coat. The tapered head and long neck add extra lift to an already stately hound.\n\n"], "80": ["Scottish Terrier", "\n\nThe silhouette of the Scottish Terrier is one of the most recognizable in dogdom. The \"Scottie\" is a compact, short-legged, sturdily-built dog. Bright, dark, piercing eyes and a long head with beard and brows convey the breed's distinctive keen expression. The Scottish Terrier is a double coated breed with a hard, wiry outer coat and a soft dense under coat. This coat comes in many colors and shades including black, wheaten or brindle. Life is serious business to the Scottie, to be met with dignity, reserve and stout heart.\n\n"], "81": ["Shetland Sheepdog", "\n\nThe Sheltland Sheepdog is an extremely intelligent and playful herding dog who loves playing with children and learning new tricks. Shelties are easy to train and are world-class competitors in obedience, agility, and herding trials. They’re loyal and affectionate with their family but can be reserved toward strangers. (Bonus: This trait makes them excellent watchdogs—like an alarm system that likes to cuddle.)\n\n"], "82": ["Shih Tzu", "\n\n​These popular toy dogs can weigh between 9 to 16 pounds, and stand between 8 and 11 inches at the shoulder. Shi Tzus are surprisingly sturdy and solid for a small dog. The coat is worth the time you’ll put into it—few dogs are as beautiful as a well-groomed Shih Tzu. And that face! Those big dark eyes, that sweet expression! It’s no surprise that Shih Tzu fans have been so devoted to their little “Lion Dogs” for a thousand years.\n\n"], "83": ["Siberian Husky", "\n\nBred in Northeast Asia as a sled dog, the Siberian Husky is known for its amazing endurance and willingness to work. Its agreeable and outgoing temperament makes it a great all-around dog, suitable for anything from sledding to therapy work. Because it originated in cold climates, Siberians have a thicker coat than most other breeds of dog, made up of a dense cashmere-like undercoat and a longer, coarse top coat. All colors from black to pure white are allowed, and a variety of markings on the head is common.\n\n"], "84": ["Silky Terrier", "\n\nAlthough a toy in size, the Silky Terrier has a true terrier personality - he is of sufficient substance to be able to hunt and kill domestic rodents. The general public occasionally confuses this breed with the Yorkie, but in reality, the Silky is larger and more closely related to the Australian Terrier. A friendly, joyful temperament and the lovely blue and tan coat make him an ideal companion.\n\n"], "85": ["Soft Coated Wheaten Terrier", "\n\nThis merry breed is set apart from other terriers by a soft, silky, gently waving coat, of warm wheaten color, much like the color of ripening wheat.They maintain their youthful vigor well into old age. Topping out at 19 inches and 40 pounds, this sturdy, square soft-coated working terrier is happiest with their families and must be raised with a gentle but firm hand.\n\n"], "86": ["St. Bernard", "\n\nNot ranked particularly high in AKC registrations, this genial giant is nonetheless among the world’s most famous and beloved breeds. The Saint Bernard's written standard abounds with phrases like “very powerful,” “extraordinarily muscular,” “imposing,” and “massive.” A male stands a minimum 27.5 inches at the shoulder; females will be smaller and more delicately built. The huge head features a wrinkled brow, a short muzzle, and dark eyes, combining to give Saints the intelligent, friendly expression that was such a welcome sight to stranded Alpine travelers.\n\n"], "87": ["Staffordshire Bull Terrier", "\n\nAt 14 to 16 inches at the shoulder Staffordshire Bull Terriers don’t stand particularly tall. But we classify them as medium-sized because, weighing anywhere between 24 to 38 pounds, Staffordshire Bull Terriers pour a gallon of dog into a quart-size container. These are rock-solid, muscular dogs renowned for their strength and agile movement. The head is short and broad, with pronounced cheek muscles, and the tight-fitting coat can be one of several colors along with white. Staffordshire Bull Terriers are smaller than their Colonial cousin, the American Staffordshire Terrier.\n\n"], "88": ["Standard Schnauzer", "\n\nSociable and affectionate, Standard Schnauzers become true members of their families and especially love children. Of the three Schnauzers breeds, the medium, or Standard, is the prototype. At 17 to 20 inches tall and weighing between 35 and 50 pounds, it is truly the “standard” Schnauzer: larger than the Miniature and smaller than the Giant. Schnauzers of all three sizes share several breed hallmarks: a wiry, tight-fitting coat of pure black or “pepper and salt”; a robust, square-built frame; and an elongated head furnished with arched eyebrows and bristly whiskers, accentuating dark brown eyes that gleam with a keen intelligence. Their sporty look is a canine classic.\n\n"], "89": ["Sussex Spaniel", "\n\nLooking a bit like a cross between a Cocker Spaniel and a torpedo, Sussex Spaniels are long, low-built bird dogs of great strength and endurance. Topping out at just 15 inches tall at the shoulder, Sussex Spaniels are nonetheless described as “massive,” with a deep chest and heavy bone. Their trademark is an abundant, feathery coat of rich golden-liver. The classic spaniel head, with its wavy-coated ears and big hazel eyes, projects a somber, frowning expression delightfully at odds with the Sussex Spaniel's innate cheerfulness.\n\n"], "90": ["Tibetan Mastiff", "\n\nAn impressively large dog with noble bearing, the Tibetan Mastiff is an aloof and watchful guardian breed. They possess a solemn but kind expression, with an immense double coat it can be black, brown and blue/grey, with or without tan markings, and various shades of gold. Although seen in shows in the United States today, they may not enjoy participating in organized activities such as obedience or agility due to their highly independent natures.\n\n"], "91": ["Vizsla", "\n\nOriginally from Hungary, the Vizsla is a medium-sized, short-coated hunting dog that is essentially Pointer in type, although he combines characteristics of both pointer and retriever. An attractive golden rust in color, this \"dual\" dog is popular in both the field and the show ring due to his power and drive while hunting and his trainability in the home.\n\n"], "92": ["Weimaraner", "\n\nOften referred to as the \"gray ghost\" because of the distinctive color of its short, sleek coat, the Weimaraner is a graceful dog with aristocratic features. Bred for speed, good scenting ability, courage and intelligence, he remains an excellent game hunter and active participant in other dog sports.\n\n"], "93": ["Welsh Springer Spaniel", "\n\nA compact dog built for hard work, the Welsh Springer Spaniel is a distinct breed, not a variety of the English Springer Spaniel. With his excellent nose and slightly webbed feet, the breed is a versatile hunter, water dog and retriever. Their trademark coat is a striking red and white in color. The beautiful coat isn’t just ornamental—it’s a waterproof, weatherproof, and thornproof suit that enables Welshies to show off their renowned versatility in all climates and on all terrains\n\n"], "94": ["Welsh Terrier", "\n\nSturdy, compact, and rugged, with a tight-fitting black-and-tan coat and a rectangular head featuring folded ears and a jaunty beard, Welsh are constructed along the classic lines of Britain’s long-legged terriers. They stand about 15 inches at the shoulder, a little larger than the Lakeland Terrier but much smaller than the mighty Airedale. All three breeds, however, share a family resemblance: An ancient breed called the Old English Black and Tan Terrier is thought to be the granddaddy of these and some other British terriers.\n\n"], "95": ["West Highland White Terrier", "\n\n​The insanely cute Westie is one of the most popular small terriers among pet owners. Standing 10 to 11 inches at the shoulder, with dark piercing eyes, compact body, and an adorable carrot-shaped tail wagging with delight, the Westie’s looks are irresistible. Beneath the plush-toy exterior, though, beats the heart of true working terrier. Bred to hunt rats and other furry critters, Westies are surprisingly strong and tough.\n\n"], "96": ["Whippet", "\n\nA medium-sized sighthound giving the appearance of elegance and fitness, the Whippet denotes great speed, power and balance. In fact, the Whippet, an English Greyhound in miniature, is the fastest domesticated animal of his weight, capable of speeds up to 35 m.p.h. A very versatile breed, they can appear in a wide variety of colors and markings. Although keen when racing or coursing, they are quiet and dignified in their owner's living room.\n\n"], "97": ["Yorkshire Terrier", "\n\nYorkshire Terriers, affectionately known as \"Yorkies,\" offer big personalities in a small package. Though members of the Toy Group, they are terriers by nature and are brave, determined, investigative and energetic. Named for the English county from which they originally hail, Yorkshire Terriers were used in the nineteenth century to catch rats in clothing mills. Surprisingly enough, in its beginnings, the Yorkie belonged to the working class, especially the weavers; in fact, facetious comments were often made about how the dogs' fine, silky coats were the ultimate product of the looms. Eventually, the breed left the workforce and became a companion animal to families of European high society.\n\n"]}